main.org
#+HUGO_BASE_DIR: .
#+options: creator:nil author:nil
#+hugo_custom_front_matter: :math true

** Emacs 快速配置与插件管理 
:PROPERTIES:
:EXPORT_HUGO_BUNDLE: easy-latex-writing-ep01-basic-setup-and-package-management
:EXPORT_FILE_NAME: _index
:CUSTOM_ID: emacs-setup
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :weight 10
:END:

本小节将介绍如何快速配置一个用于 LaTeX 写作的 [[https://www.gnu.org/s/emacs/][Emacs]], 包括软件安装和插件管理, 以及 Emacs 的一些必要的入门知识. 最后将推荐两组非常实用的插件: 第一组插件 [[https://github.com/justbur/emacs-which-key][Which-key]] + [[https://github.com/tarsius/keycast][Keycast]] + [[https://github.com/Wilfred/helpful][Helpful]] 将帮助我们快速熟悉 Emacs 的操作和概念, 第二组插件 [[https://github.com/minad/vertico][Vertico]] + [[https://github.com/minad/marginalia][Marginalia]] + [[https://github.com/oantolin/orderless][Orderless]] 将有效提升我们在小缓冲区的补全体验, 并附上 [[https://www.gnu.org/s/auctex][AucTeX]] 和 [[https://github.com/cdominik/cdlatex][CDLaTeX]] 的基本设置.

*** Emacs 安装
Emacs 可以运行在 Windows, Linux, MacOS 上, 也可以通过 =termux= 运行在 Android 手机或平板上. 这里我们只介绍电脑系统上的 Emacs 安装.

在本文撰写时 (2023.4), Emacs 的最新正式版本为 28.2, 最近的测试版本为 29.090. 下面介绍的安装方法针对的是正式版. (更新: 2023.8 已经可以下载 Emacs 29 正式版.)

在多数平台上, 我们是利用合适的开源软件管理器来安装 Emacs. 在 Linux 中这是自带的, 在 Windows 和 MacOS 中大家需要自行安装. 我们下面详细说明.

**** Linux
Linux 系统中可以用自带的软件管理器安装 Emacs. 例如, 在 Ubuntu 中使用 =apt= 安装 Emacs, 只需要在命令行中输入
#+begin_src shell
  sudo apt install emacs 
#+end_src
**** MacOS
MacOS 中需要先安装 [[https://brew.sh/][Homebrew]]. 方法是在命令行中输入
#+begin_src shell
 /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
#+end_src
当 Homebrew 安装成功后会有提示, 然后就可以使用 Homebrew 安装 Emacs 了: 在命令行中输入
#+begin_src shell
 brew install emacs
#+end_src
**** Windows
Windows 下安装 Emacs 有两种常见方法. 第一种是安装 MSYS2 ([[https://www.msys2.org/][下载链接]]). 安装后打开 =C:/msys64/mingw64.exe= (=C:/msys64/= 是 MSYS2 的默认安装目录, 根据实际情况调整). 在命令行中输入
#+begin_src shell
  pacman -S mingw-w64-x86_64-emacs
#+end_src
通过 MSYS2 安装的一个好处是我们可以通过 Pacman 管理 Emacs 的更新. 另一个好处是在上面还可以很方便安装其它开源软件, 例如 Git, Epdfinfo 等. Epdfinfo 是在 Windows 下使用 Emacs 的 [[https://github.com/vedang/pdf-tools][PDF-tools]] 插件的必需软件 ([[https://www.bilibili.com/video/BV1pg4y1s7Z9/][BV1pg4y1s7Z9]]).

另一种安装方法是直接从[[http://ftp.gnu.org/gnu/emacs/windows/emacs-28/][官网]]上下载安装包. Emacs 28 的安装包已经优化了不少, 会自动把程序安装至 =C:/Program Files/emacs= 目录下, 并附带卸载程序. 通过安装包安装的 Emacs 需要我们手动更新.
*** 安装 Emacs 后的额外设置
**** Ctrl 键设置
安装完 Emacs 之后, 我 *强烈建议* 大家交换 ~Caps Lock~  与 ~Left Ctrl~. Emacs 常常使用以 ~Ctrl~ 开始的快捷键, 因此把 ~Ctrl~ 与不常用的大写锁定 ~Caps Lock~ 交换是每个 Emacs 使用者对电脑 做的第一件事. ~Ctrl~ 键的广泛使用是因为在 Emacs 诞生之初, 当时通用的键盘 ~Ctrl~ 确实在当今的 ~Caps Lock~ 位置上. 再啰嗦一句: 交换 ~Caps lock~ 与 ~Ctrl~ 绝不是一件可有可无的事情, 它在我们日常使用 Emacs 中真的非常重要! 大家千万不要怕麻烦.

交换 ~Ctrl~ 与 ~Caps Lock~ 的方法在不同系统上也不一样.
***** Windows
Windows 中更改键位可以通过注册表或者最新的 =PowerToys= 软件.
****** 注册表方法 (适用于 Win 10 以前)
方法如下:
- ~Win~ + ~r~ 并输入 =regedit= 打开注册表
- 找到目录 =[HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Keyboard Layout]=
- 新建 =Scancode= 文件, 把内容修改为
  #+begin_src
   00 00 00 00 00 00 00 00
   03 00 00 00 1d 00 3a 00 
   3a 00 1d 00 00 00 00 00
  #+end_src
- 保存 =Scancode= 文件并重启电脑
****** PowerToys (适用于 Win 10, Win 11)
- 将系统中 "微软商店" 更新到最新版本 (Win 10 不更新可能会找不到 PowerToys)
- 在 "微软商店"= 中搜索 =PowerToys= 并安装
- 在 PowerToys 中找到键位设置, 并交换 ~Caps Lock~ 和 ~Left Control~
***** Ubuntu 及其它 Linux 系统
在 Ubuntu 下, 可以安装 Gnome-tweaks: 
#+begin_src shell
 sudo apt install gnome-tweaks
#+end_src
然后打开 Gnome-tweaks 的键盘设置, 在高级选项里有关于 ~Ctrl~ 键的设置. 你不仅仅可以交换它与 ~Caps Lock~, 也可以进行许多别的设置.

又或者, 在很多 Linux 系统的命令行下输入
#+begin_src shell
  setxkbmap -option ctrl:swapcaps
#+end_src
也可以交换 ~Ctrl~ 与 ~Caps Lock~ .
***** MacOS 
在 MacOS 中, 大家可以在 =system= -> =keyboard= -> =functional keys= 中调整所有功能键的键位.
**** 家目录与系统路径
剩下两个设置只有 Windows 用户需要进行.

第一是把 Emacs 的家目录, 即 Emacs 中通过 =~= 访问的目录, 改成 =C:/Users/<用户名>/=. 默认的家目录是 =C:/Users/<用户名>/AppData/Roaming/=. 从这个目录出发不方便我们访问像 "我的文档" 这种常用文件夹, 所以我们需要手动修改家目录为 =C:/Users/<用户名>/=, 与 Linux 和 MacOS 的使用习惯保持一致.

修改家目录的方法是在环境变量的设置中 (可以在 Windows 搜索栏中搜索 =Edit system variables= 打开), 增加一个用户的环境变量 =HOME=, 把它设置为 =C:/Users/<用户名>/=.

第二是保证你的 Emacs 安装目录在系统变量 =PATH= 上. 如果不在, 还是在同一个界面, 把包含你 =emacs.exe= 的文件夹路径手动添加到 =PATH= 变量中. 

*** Emacs 基本知识讲解与必知快捷键
作为 Emacs 新手, 大家需要理解的一个核心概念就是命令. 在 Emacs 中所有的操作, 无论简单复杂都是命令.
Emacs 这个单词就来自于 macro, 即宏命令. 比如说我们想执行打开一个文件的操作, 有 3 种方式等价的操作方式:
1. 在菜单栏里选择 =file= -> =visit new file=, 然后和普通的软件一样选择你要打开的文件.
2. 执行 =open-file= 命令. 方法是按下 ~M-x~ (~M~ = ~Alt~), 然后在最下面的小缓冲区输入 =open-file=, 然后输入文件名.
3. 按下 ~C-x C-f~ 快捷键, 并输入文件名.

Emacs 中有许多有用的命令. 你未来也可以自己通过 Elisp 语言编写自己命令. Emacs 把其中最常用的命令都绑定了快捷键, 用户自己也可以设置自己的快捷键. 当我们用熟了之后, 很多快捷键就会像打字一样形成肌肉记忆. 作为新手, 我们有很多键盘的快捷操作可以用鼠标代替, 因此你不必急于一下子掌握全部 Emacs 的快捷键.

但是, 仍有一些快捷键是大家最好尽快熟悉的. 下面这张表我给大家总结了新手必知的几个快捷键.
在表中, ~C~ 表示 ~Ctrl~, ~M~ 表示 ~Alt~. 这也是 Emacs 快捷键通用写法. 最右边一列是快捷键对应的命令名, 也就是第一列所有的快捷键都等价于 ~M-x~ 加上第三列. 
|-------------+--------------------+----------------------------------|
| 快捷键       | 操作                | 命令名                            |
|-------------+--------------------+----------------------------------|
| ~C-g~       | 中止当前一!切!命!令! | =keyboard-quit=                  |
| ~C-/~       | 撤销命令            | =undo=                           |
|-------------+--------------------+----------------------------------|
| 文件操作     |                    |                                  |
| ~C-x C-f~   | 打开文件            | =find-file=                      |
| ~C-x C-s~   | 保存文件            | =save-buffer=                    |
| ~C-x b~     | 切换文件 (缓冲区)    | =switch-to-buffer=               |
| ~C-x 1~     | 关闭其它窗口         | =delete-other-window=            |
|-------------+--------------------+----------------------------------|
| ~C-h f/v/k~ | 查询命令/变量/快捷键  | =describe-function/variable/key= |
|-------------+--------------------+----------------------------------|
| 文本处理     |                    |                                  |
| ~M-x~       | 复制                | =kill-ring-save=                 |
| ~C-w~       | 剪切                | =kill-region=                    |
| ~C-y~       | 粘贴                | =yank=                           |
|-------------+--------------------+----------------------------------|
**** 中止命令与撤销命令
在 Emacs 中发生误操作时, 你需要知道如何中止与撤销命令. 当你的快捷键输入一半想反悔时 (是的, Emacs 的快捷键可以很长!), 可以使用 ~C-g~ 重新来输入, 又或者 Emacs 在执行命令时卡住了, 你可以通过 ~C-g~ 来让它恢复正常.

如果你需要撤回上一条命令, 则需要使用 ~C-/~. 但值得注意的是, 撤回撤回命令的命令也是同一个键; 这偶尔会让人抓狂. 
**** 文件与窗口相关命令
下面我们介绍 Emacs 中最基础的几个管理界面的快捷键.

首先是打开文件, ~C-x C-f~, 命令名是 =find-file=. 这里的 =find= 隐含 Emacs 会根据不同情况执行不同操作: 若文件存在, 则是普通的打开文件; 若文件不存在, 则是打开一个新文件.

第二个是保存文件, ~C-x C-s~, 对应 =save-buffer=, 即把当前缓冲区 (更新后) 的内容写进文件里.

大多数情况将缓冲区 (buffer) 等同于文件不会影响你的 Emacs 使用. 这里简单讲讲它们的不同. 文件存在于电脑硬盘上, 而 Emacs 的缓冲区只显示文件内容. 当你把文件内容读入缓冲区以后, 又在 Emacs 外修改了文件的内容, 缓冲区中的内容并不会改变, 除非你明确指示 Emacs 重新读取. 而在 Windows 中, 一个文件同时只能被一个 Windows 程序打开. Emacs 的缓冲区也不一定对应着文件, 在模式栏大家可以看到当前缓冲区的名字. 名字被两个 =*= 号包含的一般是非文件的缓冲区, 例如 =*Message*= 用于显示 Emacs 给用户的信息, 编译 LaTeX 时 =*Output*= 会存放编译输出结果等.

第三个命令是切换缓冲区/文件, ~C-x b~, 对应 =switch-to-buffer=. 执行后在最下方的小缓冲区会提示输入你想要切换的缓冲区名字, 默认是上一个显示的缓冲区, 直接回车就行.

在 Emacs 中同时显示多个缓冲区的方法是打开多个窗口 (window), 然后在每个窗口中显示一个缓冲区. 有时 Emacs 自动创建新的窗口, 例如展示帮助信息时. 新手最常用的操作是保留当前光标所在窗口, 而关掉其它所有窗口. 这可以通过, ~C-x 1~, 即 =delete-other-window= 实现. 我们可以用鼠标辅助我们在不同窗口间切换. 
**** 帮助命令
Emacs 中查询帮助信息的快捷键是 ~C-h <字母>~. 常用的有 ~C-h f~, 查询命令, ~C-h v~, 查询变量, 以及 ~C-h k~, 查询快捷键. 通常 ~C-h~ 命令会自动创建新的窗口显示帮助信息.  我们可以先把光标移到我们工作的缓冲区, 然后用 ~C-x 1~ 关闭掉帮助信息窗口. 注意此时帮助信息的缓冲区并没有关闭, 重新显示可以通过 ~C-x b~ 并查找以 =*help*= 命名的缓冲区. 

**** 复制/剪切/粘贴
Emacs 有自己一套复制/剪切/粘贴的快捷键: ~M-w~ / ~C-w~ / ~C-y~. 这和一般程序的 ~C-c~ / ~C-x~ / ~C-v~ 不同, 需要大家习惯. 所有复制或剪切的内容都会进入一个叫 =kill-ring= 的地方, 它相当于一个剪粘版的历史记录. 粘贴快捷键 ~C-y~ 会粘贴最近一条记录, 如果你想访问之前的记录, 可以紧跟着 ~C-y~ 再按下一次或多次 ~M-y~. 

