content/ELatex/easy-latex-writing-ep01-basic-setup-and-package-management/_index.md


## Emacs 插件管理 {#emacs-插件管理}

接下来我们介绍如何更好地管理 Emacs 插件. Emacs 插件也叫 Emacs 包 (package). 插件可以给我们带来更多的功能, 是 Emacs 使用中不可缺少的一环. 插件的安装和设置与其它的 Emacs 设置一样, 都放在 Emacs 的启动文件 `~/.emacs.d/init.el` 中. 关于插件安装与设置, 我推荐大家使用现在常用的 `use-package` 语法, 它的语法更简洁, 还可以很方便地自动安装插件.

Emacs 中下载新的插件可以通过不同的方式 (这也是由某些插件提供的). 常用的有两种, 一种是用内置的 `package.el`, 这个插件名字就叫 `package.el`, `.el` 后缀来自于 Emacs 的编程语言 Elisp.
第二种是用 [Straight](https://github.com/radian-software/straight.el). `package.el` 会从官方的插件库 (ELPA, MELPA) 或镜像网站上下载新插件, 而 Straight 用下载插件的源代码并编译, 一般是利用 Git 从 Github 上下载. 为了使用 Straight, 你需要系统上已经安装了 Git 程序, 并且能正常地访问 `github.com`. 以下我们介绍两种安装方式如何设置.

我们在 `package.el` 和 Straight 的设置示例中都手动检查并安装了 `use-package`. Emacs 29 后 `use-package` 已经是内置插件, 相关代码可以省去.


### `package.el` 设置示例 {#package-dot-el-设置示例}

以下我们提供了 `package.el` 的一个设置示例. 大家需要把如下代码放入设置文件 `./.emacs.d/init.el` 中.

```elisp
    ;; -*- lexical-binding: t; -*-
    ;; 静态作用域声明必须放在首行
    ;; 把 Emacs 自动添加的代码放到 custom.el 中
    (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
    ;;========================================
    ;; 使用 package.el 设置 Emacs 插件管理
    ;;========================================
    (require 'package) ; 加载 package.el
    (setq package-check-signature nil) ; 如果检查签名有问题可以加入这一行
    ;; 添加仓库位置
    (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/") t)
    (add-to-list 'package-archives '("melpa-stable" . "http://stable.melpa.org/packages/") t)
    ;; 国内用户也可以使用清华的镜像网站. 用下面的代码代替上面两行
    ;; (setq package-archives
    ;;       '(("gnu" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/gnu/")
    ;;         ("nongnu" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/nongnu/")
    ;;         ("melpa-stable" . "http://mirrors.tuna.tsinghua.edu.cn/elpa/stable-melpa/")
    ;;         ("melpa"  . "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")))
    ;; 刷新插件列表
    (unless package-archive-contents
      (package-refresh-contents))
    ;; 自动安装 use-package. 在Emacs 29中已内置故可省略
    (unless (package-installed-p 'use-package)
      (package-install 'use-package))
    ;; 自动安装所有使用 use-package 声明的插件
    (require 'use-package-ensure)
    (setq use-package-always-ensure t)
    ;;========================================
    ;; Emacs 插件管理设置完毕
    ;;========================================


    ;;========================================
    ;; 这段代码放在最后, 加载 Emacs 自动设置的变量
    (if (file-exists-p custom-file) (load-file custom-file))
    ;;========================================
```

这段代码的第一部分启用了 `package.el`, 然后通过 `package-archives` 变量设置了下载插件的网址. 在国内也可以使用清华的软件源. 接下来 `package-refresh-contents` 刷新了插件列表. 然后我们自动检测 `use-package` 是否安装, 如果没有安装则自动下载安装. 最后, 我们设置了 `use-package-always-ensure` 变量为 `t`, 这样以后我们所有用 `use-package` 声明的插件都会自动安装.


### `straight.el` 设置示例 {#straight-dot-el-设置示例}

`straight` 需要用 `git` 从 `github` 等网站上下载源码. 请再三确认 `git` 在系统路径上 (尤其是用 `msys2` 安装的 Windows 用户).

因为 `straight.el` 与 `package.el` 难以共存, 所以我们必须早早手动禁用内置的 `package.el`. 这必须修改一个我们平时很少用的文件 `.emacs.d/early-init.el`. 我们需要在 `early-init.el` 中加入

```elisp
  ;; 在执行 init.el 前禁用 package.el
  (setq package-enable-at-startup nil)
```

接下来, 我们需要在 `init.el` 中加入以下代码:

```elisp
  ;; -*- lexical-binding: t; -*-
  ;;========================================
  ;; 把 Emacs 自动添加的代码放到 custom.el 中
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  ;; 使用 straight.el 设置 Emacs 插件管理
  ;;========================================
  (defvar bootstrap-version)
  ;; 修复 Emacs 29 修改了 native-compile 相关变量导致的 bug
  (unless (version<= emacs-version "28.2")
    (setq straight-repository-branch "develop"))
  ;; 以下代码从 straight.el 主页 https://github.com/radian-software/straight.el 上复制
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (straight-use-package 'use-package) ; 用 straight.el 安装 use-package 声明的插件
  (setq straight-use-package-by-default t) ; 自动安装所有插件, 相当于加入 :straight t
  ;;========================================
  ;; Emacs 插件管理设置完毕
  ;;========================================

  ;;========================================
  ;; 这段代码放在最后, 加载 Emacs 自动设置的变量
  (if (file-exists-p custom-file) (load-file custom-file))
  ;;========================================
```

这里大部分的代码是 `straight.el` 的 [Github主页](https://github.com/radian-software/straight.el)上提供的下载与安装 `straight` 的代码, 然后再用 `straight` 安装 `use-package`. 最后我用把 `straight-use-package-by-default` 变量设为 `t`, 这是在使用 `straight` 时进行插件自动安装的设置.


## 推荐插件 {#推荐插件}

下面我给大家推荐两组非常实用的插件. 在进行好 `package.el` 或者 `straight.el` 的设置后 (注意: 不能同时使用), 安装与设置插件只需要把相关的 `use-package` 代码块复制到 `init.el` 即可. 而且在两个体系下的代码块基本是通用的.

我们之前也都设置了自动安装插件. 当你第一次执行 `init.el` 时 (通常是第一次重启 Emacs 的时候), Emacs 会自动检测你在 `init.el` 中声明的插件是否已经安装, 若没有则通过指定的方法 (`package.el` 或 `straight.el`) 自动下载安装. 如果大家在一台新的机器上使用 Emacs, 把 `init.el` 文件复制到新机器上就可以直接获得一模一样的使用体验!

你也可以在修改完 `init.el` 后, 执行 <kbd>M-x</kbd> `eval-buffer` 命令手动加载新加的 `use-package` 代码块.

在复制代码块中最常见的问题是某个地方在复制的过程中漏了括号. 大家已经发现 elisp 语言中括号是必须配对的. 我们可以在修改 `init.el` 后手动的用 <kbd>M-x</kbd> `match-paren` 检查括号是否匹配. 如果有不匹配的括号, 那么光标就会跳过没有匹配成功的括号上, 否则这个命令不会用任何效果.


### 插件组合1: 更多的帮助信息 {#插件组合1-更多的帮助信息}

我们首先介绍 [Which-key](https://github.com/justbur/emacs-which-key) + [Keycast](https://github.com/tarsius/keycast) + [Helpful](https://github.com/Wilfred/helpful). 安装代码如下

```elisp
  (use-package which-key
    :custom (which-key-idle-delay 0.5) ; 延迟时间, 以秒为单位
    :config (which-key-mode)) ; 启用 which-key 模式

  (use-package keycast
    :config (keycast-header-line-mode 1)) ; 在标题显示

  (use-package helpful
    :bind
    ;; 重新定向 C-h 开始的命令
    (([remap describe-function] . #'helpful-callable)
     ([remap describe-variable] . #'helpful-variable)
     ([remap describe-key] . #'helpful-key)
     ([remap describe-command] . #'helpful-command)
     ([remap describe-symbol] . #'helpful-symbol)
     ("C-h C-d" . #'helpful-at-point)
     ("C-h F" . #'helpful-function)))
```

`which-key` 可以在按下快捷键的时候自动提示你接下来可能的快捷键. 比如按下 <kbd>C-h</kbd>, 就会提示接下来你按 <kbd>v</kbd>, <kbd>f</kbd>, <kbd>k</kbd> 等可以查看哪种类型的帮助. 如果把鼠标悬停在选项上也会在浮窗中显示对应命令的帮助.

`keycast` 则会显示当前你使用的快捷键及对应的命令名. 它有4种显示的位置. 代码中我们选择在 `headrer-line` , 也就是 Emacs 窗口的最上方显示. 如果大家想在别的地方显示, 比如模式栏, 可以把 `(keycast-header-line-mode 1)` 改成 `(keycast-mode-line-mode 1)`.

这两个插件可以帮助新手快速熟悉 Emacs 的快捷键和命令. 对于老用户来说, 也可以帮你快速熟悉新安装的插件. 我自己平时也是常开的.

`helpful` 则优化了帮助界面的信息显示, 包括更多有用的信息和高亮.


### 插件组合2: 更好的补全界面 {#插件组合2-更好的补全界面}

在 Emacs 中输入命令或打开文件, 切换缓冲区等等都会用到小缓冲区补全. 第二组插件 [Vertico](https://github.com/minad/vertico) + [Marginalia](https://github.com/minad/marginalia) + [Orderless](https://github.com/oantolin/orderless) 是针对小缓冲区补全的. 代码如下

```elisp
  (use-package vertico ; 竖式展开小缓冲区
    :custom (verticle-cycle t)
    :config (vertico-mode))

  (use-package marginalia ; 更多信息
    :config (marginalia-mode))

  (use-package orderless ; 乱序补全
    :custom
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles partial-completion)))))
```

`vertico` 把每个补全选项放在单独的一行, 配合 `marginalia` 会在每个选项的右边加入更多相关信息.

在小缓冲区中输入时, 我们可以按 <kbd>Tab</kbd> 补全当前的输入. 加入 `vertico` 之后, 我们可以用 <kbd>C-n</kbd> 和 <kbd>C-p</kbd> 或者上下移动键来选择不同的补全选项. <kbd>C-n</kbd> 和 <kbd>C-p</kbd> 也是 Emacs 中上下移动光标的快捷键.

最后的 `orderless` 允许我们在小缓冲区补全时忽略单词的顺序. 例如, 如果我们输入 <kbd>M-x</kbd>, 想要匹配 `find-file` 命令, 在默认情况下必须先输入 `find`, 再输入 `file` 才能找到 `find-file`. 如果你用了 `orderless`, 则可以通过 `file find` 找到, 或者部分的单词 `fil fin` + ~Tab~= 找到.
