main.org
*** 基本的 =CDLaTeX= + =AucTeX= 设置
最后我们提供一个简单可用的 =CDLaTeX= 和 =AucTeX= 设置. 大家只要把这段代码复制进 =init.el= 就可以实现视频[[https://www.bilibili.com/video/BV1Xk4y1a7Gp/][五分钟说服你用Emacs写LaTeX]]中的大部分功能.
#+begin_src elisp
  (defun my/latex-hook ()
    (turn-on-cdlatex) 
    (turn-on-reftex)) 
  (use-package cdlatex
    :load-path "lisp/" ; 需要手动从网盘或 https://github.com/cdominik/cdlatex/blob/master/cdlatex.el 下载 cdlatex.el 文件, 并置于 ~/.emacs.d/lisp/ 文件夹下
    ;; 若使用 straight, 注释前一行, 并取消下一行注释:
    ;; :straight (:host github :repo "cdominik/cdlatex" )
    )
  (use-package tex
    :ensure auctex
    ;; 若使用 straight, 注释前一行, 并取消下一行注释:
    ;; :straight auctex
    :custom
    (TeX-parse-self t) ; 自动解析 tex 文件
    (TeX-PDF-mode t) 
    (TeX-DVI-via-PDFTeX t)
  :config 
    (setq-default TeX-master t) ; 默认询问主文件
    (add-hook 'LaTeX-mode-hook 'my-latex-hook)) ; 加载LaTeX模式设置
#+end_src

这个基本设置不一定能实现 PDF 正向或反向搜索, 因为这取决于操作系统与 PDF 阅读器. 如果你想在不同平台上使用 Emacs 并获得统一的 PDF 体验, 可以考虑使用 PDF-tools (见视频 [[https://www.bilibili.com/video/BV1pg4y1s7Z9/][BV1pg4y1s7Z9]]).

关于 CDLaTeX 的安装, 要注意的是, 它并不在任何的软件源时. 如果使用 =package.el=, 你需要手动下载这个文件 ([[https://github.com/cdominik/cdlatex/blob/master/cdlatex.el][Github链接]] 或者我网盘里的备份), 并用 ~:load-path~ 关键字指定文件的目录. 如果是 Straight, 则需要我们指定 Github 仓库的地址 =cdominik/cdlatex=.

AucTeX 是通过 =(use-package tex)= 激活的. 因为包名不统一的问题, 我们要额外加入 =:ensure auctex= 或 =:straight auctex=. 其实 Emacs 已经内置了 AucTeX, 但不一定是最新版本, 我们这里的 =use-package= 则会把它更新到最新版.

*** 有用的链接
- Emacs 官网: https://www.gnu.org/software/emacs/
- 我的坚果云分享: https://www.jianguoyun.com/p/DTiBwxMQ856tCxiflP0E
- 我的 Emacs 设置: [[https://gitee.com/mickey991/emacs-config.git]] 


